# [Report | Отчет](Report2.pdf)

1. Был разработан класс для представления неориентированного графа и поиска цикла или пути между двумя вершинами при заданных условиях на языке Python.
2. Была создана программа для выполнения конкретного задания, которая обеспечивает ввод описания графа из текстового файла.
3. Внутреннее представление графа реализовано в двух вариантах: граф_матр (матрица смежности) и граф_спис (множество списков смежных вершин).
4. Программа обеспечивает представление исходного графа и результата в графическом виде.
5. Был выполнен поиск цикла, проходящего не более чем через две вершины центра графа при использовании внутреннего представления графа в виде граф_матр.
